Revit 2027 API
ParameterTypeId.MaterialAssetParamExternalMaterialId Property
 "External Material ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAssetParamExternalMaterialId { get; }
Public Shared ReadOnly Property MaterialAssetParamExternalMaterialId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAssetParamExternalMaterialId {
	ForgeTypeId^ get ();
}
static member MaterialAssetParamExternalMaterialId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace